/*描述
根据输入的日期，计算是这一年的第几天。


输入描述：
输入一行，每行空格分割，分别是年，月，日

输出描述：
输出是这一年的第几天*/
#include<stdio.h>

int main() {
    int a[2][12] = { {31,28,31,30,31,30,31,31,30,31,30,31},{31,29,31,30,31,30,31,31,30,31,30,31} };
    int y, m, d, res = 0;
    int flag;
    scanf("%d %d %d", &y, &m, &d);
    if (((y % 4 == 0) && (y % 100 != 0)) || ((y % 100 == 0) && (y % 400 == 0))) {
        flag = 1;
    }
    else flag = 0;

    for (int i = 0; i < m - 1; i++) {
        res = res + a[flag][i];
    }
    printf("%d\n", res + d);
    return 0;
}