#include<stdio.h>

int main()
{
	//一维数组
	int a[] = { 1, 2, 3, 4 };
	printf("%d\n", sizeof(a));//16  
	//1.数组名单独放在sizeof内部，数组名表示整个数组，所以sizeof(数组名)计算的是是数组总大小，单位是字节
	//2.&数组名，数组名表示整个数组，所以&数组名取出的是整个数组的地址
	//3.除此之外，所有的数组名都表示首元素的地址
	printf("%d\n", sizeof(a + 0));//4    a代表首元素地址，a+i代表第i个元素的地址，在32位平台下所有的地址的大小都是4个字节
	printf("%d\n", sizeof(*a));//4       a是首元素地址，*a是首元素--1，int型占4个字节大小
	printf("%d\n", sizeof(a + 1));//4    a是首元素地址，a+1是第二个元素的地址，它还是一个地址
	printf("%d\n", sizeof(a[1]));//4     a[1]--第二个元素
	printf("%d\n", sizeof(&a));//4       &a虽然取出的是整个数组的地址，但它还是一个地址
	printf("%d\n", sizeof(*&a));//16     &a取出的是整个数组的地址，对它进行解引用，就是这个数组，这个数字的大小就是16
	printf("%d\n", sizeof(&a + 1));//4   &a取出的是整个数组的地址，加1跳过了整个数组（16个字节），但它还是一个地址
	printf("%d\n", sizeof(&a[0]));//4    &a[0]取的是第一个元素的地址
	printf("%d\n", sizeof(&a[0] + 1));//4   &a[0] + 1取的是第二个元素的地址

	return 0;
}
