/*多组输入，一个整数（2~20），表示直角三角形直角边的长度，即“*”的数量，也表示输出行数。
针对每行输入，输出用“*”组成的对应长度的直角三角形，每个“*”后面有一个空格。*/
#include<stdio.h>
int main()
{
    int n = 0;
    while (~scanf("%d", &n))
    {
        int i = 0;
        for (i = 0; i < n; i++)        //控制行号
        {
            int j = 0;
            for (j = 0; j < n - 1 - i; j++)        //每行有两个内容组成，这里是空格和*号，第一个j控制空格，因为最底层为两个空格，往上递加是4个，8个，
                                        //所以打印以两个空格为一组
            {
                printf("  ");
            }
            for (j = 0; j <= i; j++)          //这里的j控制*和空格
            {
                printf("* ");
            }
            printf("\n");

        }
    }
    return 0;
}